app/views/people/index.html.erb

        <td><%= person.talking_points %></td>
        <td><%= person.encounters.where(:user_id => current_user.id).count %></td>
---
SELECT COUNT(*) FROM "encounters" WHERE "encounters"."person_id" = ? AND "encounters"."user_id" = ?  [["person_id", 1], ["user_id", 5]]