app/views/people/new.html.erb

SELECT "companies".* FROM "companies"
---
        </label>
        <%= select_tag(:company_id, options_from_collection_for_select(Company.all, :id, :company_name), :class => "form-control") %>