app/views/people/show.html.erb

      <dt>Times met</dt>
      <dd><%= @person.encounters.where(:user_id => current_user.id).count %></dd>
---
SELECT COUNT(*) FROM "encounters" WHERE "encounters"."person_id" = ? AND "encounters"."user_id" = ?  [["person_id", 1], ["user_id", 5]]

              </label>
              <%= select_tag(:event_id, options_from_collection_for_select(Event.all, :id, :display_name), :class => "form-control") %>
---
SELECT "events".* FROM "events"