app/views/encounters/edit.html.erb

        </label>
        <%= select_tag(:event_id, options_from_collection_for_select(Event.all, :id, :display_name), :class => "form-control") %>
---
SELECT "events".* FROM "events"