app/views/encounters/new.html.erb

SELECT "events".* FROM "events"
---
        </label>
        <%= select_tag(:event_id, options_from_collection_for_select(Event.all, :id, :display_name), :class => "form-control") %>