app/controllers/companies_controller.rb

INSERT INTO "companies" ("company_name", "local_address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["company_name", "McKinsey"], ["local_address", "300 E Randolph St, Chicago, IL 60601"], ["created_at", "2017-06-11 18:37:45.788130"], ["updated_at", "2017-06-11 18:37:45.788130"]]
---
  def create
    @company = Company.new

    @company.company_name = params[:company_name]
    @company.local_address = params[:local_address]

    save_status = @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def update
    @company = Company.find(params[:id])