app/controllers/encounters_controller.rb

  def index
    @encounters = Encounter.all
---
SELECT "encounters".* FROM "encounters"

  def show
    @encounter = Encounter.find(params[:id])
---
SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @encounter = Encounter.new

    @encounter.person_id = params[:person_id]
    @encounter.event_id = params[:event_id]
    @encounter.thankyouletter_sent = params[:thankyouletter_sent]
    @encounter.user_id = params[:user_id]

    save_status = @encounter.save
---
INSERT INTO "encounters" ("person_id", "event_id", "thankyouletter_sent", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["person_id", 1], ["event_id", 1], ["thankyouletter_sent", "t"], ["user_id", 1], ["created_at", "2017-06-11 23:39:54.511681"], ["updated_at", "2017-06-11 23:39:54.511681"]]

  def edit
    @encounter = Encounter.find(params[:id])
---
SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def destroy
    @encounter = Encounter.find(params[:id])

    @encounter.destroy
---
SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "encounters" WHERE "encounters"."id" = ?  [["id", 1]]