app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"
---
  def show
    @event = Event.find(params[:id])
    @events = Event.all

INSERT INTO "events" ("event_name", "event_location", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_name", "1Y Networking night"], ["event_location", "Harper"], ["date", "2016-03-10"], ["created_at", "2017-06-11 21:06:08.760351"], ["updated_at", "2017-06-11 21:06:08.760351"]]
---
  def create
    @event = Event.new

    @event.event_name = params[:event_name]
    @event.event_location = params[:event_location]
    @event.date = params[:date]
    #@event.company_id = params[:company_id]

    save_status = @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", nil], ["updated_at", "2017-06-12 04:35:28.871422"], ["id", 1]]
---
  def update
    @event = Event.find(params[:id])

    @event.event_name = params[:event_name]
    @event.event_location = params[:event_location]
    @event.date = params[:date]
    #@event.company_id = params[:company_id]

    save_status = @event.save