app/controllers/people_controller.rb

SELECT  "encounters".* FROM "encounters" WHERE "encounters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @person = Person.find(params[:id])
    @encounter = Encounter.find(params[:id])